name: "MNIST_LeCun"
layer {
  name: "MNIST"
  type: "Data"
  transform_param {
    scale: 0.00390625
  }
  data_param {
    source: "Part1_Task2/MNIST_train"
    batch_size: 64
    backend: LMDB
  }
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
}

layer {
  name: "MNIST"
  type: "Data"
  transform_param {
    scale: 0.00390625
  }
  data_param {
    source: "Part1_Task2/MNIST_test"
    batch_size: 100
    backend: LMDB
  }
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
}

layer {
  name: "C1"
  type: "Convolution"
  bottom: "data"
  top: "C1"
  param { lr_mult: 1 }
  param { lr_mult: 2 }
  convolution_param {
    num_output: 20
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "S2"
  type: "Pooling"
  bottom: "C1"
  top: "S2"
  pooling_param {
    pool: MAX
    stride: 2
    kernel_size: 2
  }
}
layer {
  name: "C3"
  type: "Convolution"
  bottom: "S2"
  top: "C3"
  param { lr_mult: 1 }
  param { lr_mult: 2 }
  convolution_param {
    num_output: 50
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "S4"
  type: "Pooling"
  bottom: "C3"
  top: "S4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "S4"
  top: "ip1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 500
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "ip1"
  top: "ip1"
}
layer {
  name: "ip2"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "ip2"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "ip2"
  bottom: "label"
  top: "loss"
}
